braindump/Hydrodynamic Mass.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Hydrodynamic Mass</title>
<meta name="author" content="Bibek Panthi" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="../css/stylesheet.css" />
<link rel="stylesheet" type="text/css" href="../css/braindump.css" />

</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="./index.html"> UP </a>
 |
 <a accesskey="H" href="../index.html"> HOME </a>
</div><div id="content" class="content">
<h1 class="title">Hydrodynamic Mass</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org29f7a79">1. Hydrodynamic Mass</a>
<ul>
<li><a href="#org29348fe">1.1. Ideally, the hydrodynamic force should be calculated based on the three- dimensional Navier-Stokes equations. Obviously, this is difficult, even in simple cases. In many practical situations, the effects of fluid viscosity and compressibility on the hydrodynamic mass can be neglected. In these cases, incompressible potential flow theory can be used to calculate the hydrodynamic mass.</a></li>
<li><a href="#orgf466fe0">1.2. D'Alembert's paradox</a></li>
<li><a href="#orgf238161">1.3. Body moving at a variable velocity, even in a condition of potential flow, experiences a resistanc</a></li>
<li><a href="#org7eb6589">1.4. hydrodynamic mass is proportional to the fluid density p and the body volume V</a></li>
<li><a href="#orge9bc027">1.5. Tensor: six-by-six matrix</a></li>
<li><a href="#org6162373">1.6. A Single Cylinder in an Infinite Fluid</a></li>
<li><a href="#org6236033">1.7. Fig 2</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org29f7a79" class="outline-2">
<h2 id="org29f7a79"><span class="section-number-2">1.</span> Hydrodynamic Mass</h2>
<div class="outline-text-2" id="text-1">
</div>

<div id="outline-container-org29348fe" class="outline-3">
<h3 id="org29348fe"><span class="section-number-3">1.1.</span> Ideally, the hydrodynamic force should be calculated based on the three- dimensional Navier-Stokes equations. Obviously, this is difficult, even in simple cases. In many practical situations, the effects of fluid viscosity and compressibility on the hydrodynamic mass can be neglected. In these cases, incompressible potential flow theory can be used to calculate the hydrodynamic mass.</h3>
<div class="outline-text-3" id="text-1-1">
</div>
</div>

<div id="outline-container-orgf466fe0" class="outline-3">
<h3 id="orgf466fe0"><span class="section-number-3">1.2.</span> D'Alembert's paradox</h3>
<div class="outline-text-3" id="text-1-2">
<p>
A structural component moving at a constant velocity in an infinite ideal fluid encounters no resistance.  This is known as D'Alembert's paradox.
</p>
</div>
</div>

<div id="outline-container-orgf238161" class="outline-3">
<h3 id="orgf238161"><span class="section-number-3">1.3.</span> Body moving at a variable velocity, even in a condition of potential flow, experiences a resistanc</h3>
<div class="outline-text-3" id="text-1-3">
<p>
the body behaves as though an added mass of fluid were rigidly attached to and moving with it.  When the body is subjected to an excitation, not only must the mass of the body be accelerated, but also that of the added fluid mass. This extra mass is call the  <b>hydrodynamic mass</b> (or added mass).
</p>
</div>
</div>

<div id="outline-container-org7eb6589" class="outline-3">
<h3 id="org7eb6589"><span class="section-number-3">1.4.</span> hydrodynamic mass is proportional to the fluid density p and the body volume V</h3>
<div class="outline-text-3" id="text-1-4">
<p>
\(m = \rho V c_m\) 
</p>

<p>
\(c_m\) is hydrodynamic mass coefficient. 
</p>
</div>
</div>


<div id="outline-container-orge9bc027" class="outline-3">
<h3 id="orge9bc027"><span class="section-number-3">1.5.</span> Tensor: six-by-six matrix</h3>
<div class="outline-text-3" id="text-1-5">
<p>
For a body having three degrees of freedom both in translation and rotation, a complete descriptioa of the hydrodynamic mass requires a six-by-six matrix.  
</p>
</div>
</div>

<div id="outline-container-org6162373" class="outline-3">
<h3 id="org6162373"><span class="section-number-3">1.6.</span> A Single Cylinder in an Infinite Fluid</h3>
<div class="outline-text-3" id="text-1-6">
<p>
\(c_m = Re(H)\) 
\(S = \frac{\omega R^2} {\nu}\)
</p>

<p>
c<sub>v</sub> is associated with viscosity. <a href="#org7eb6589">(Equation)</a>
</p>

<p>
Curves of this are given in <a href="#org6236033">Fig 2</a>.
</p>
</div>
</div>

<div id="outline-container-org6236033" class="outline-3">
<h3 id="org6236033"><span class="section-number-3">1.7.</span> Fig 2</h3>
<div class="outline-text-3" id="text-1-7">
<hr />
<h3>Backlinks</h3>

<ul class="org-ul">
<li><a href="fluid.html#ID-97B5C9E6-ADA1-46C4-80AF-649B2E25B96A">Fluid</a></li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<hr/>You can send your feedback, queries <a href="mailto:bpanthi977@gmail.com?subject=Feedback: Hydrodynamic Mass">here</a><span id="visits"></span><span id="claps"></span><div id="claps-message"></div>
</div>
</body>
</html>